// Lab_03_1.cpp
// Киричинський Богдан
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 6
#include <iostream>
#include <cmath>
using namespace std;
int main()
{
	double x; // вхідний параметр
	double y; // результат обчислення виразу
	double A; // проміжний результат - функціонально стала частина виразу
	double B; // проміжний результат - функціонально змінна частина виразу
	cout << "x = "; cin >> x;

	A = 5 * (pow(e, 3x));
	if (x <= -1)
		B = 3 + sin(fabs(x));
	if (-1 < x && x <= 3)
		B = 2 * (pow(e, x / 4) - 1);
	if (x > 3)
		B = 7 - sqrt(2 * pow(x, 3));
	y = A - B;
	cout << end1;
	cout << "1) y =" << end1;

	// спосіб 1: розгалуження в скороченій формі

	cin.get();
	return 0;
}